var xitems = [
    {
        "name":"淑瑜",
        "location":"108.39137,22.829323",
        "phone":"电话",
        "city":"青秀",
        "address":"德利AICC, caros [108.39137,22.829323]"
    },
    {
        "name":"阿秀",
        "location":"108.381196,22.728146",
        "phone":"电话",
        "city":"良庆",
        "address":"合景天汇广场, caros [108.381196,22.728146]"
    },
    {
        "name":"郁天",
        "location":"108.387814,22.698509",
        "phone":"13692290530",
        "city":"良庆",
        "address":"建工城, caros [108.387814,22.698509]"
    },
    {
        "name":"皙琳",
        "location":"108.418527,22.866423",
        "phone":"电话",
        "city":"兴宁",
        "address":"恒大雅苑, caros [108.418527,22.866423]"
    },
    {
        "name":"陆娜",
        "location":"108.38652,22.72439",
        "phone":"电话",
        "city":"良庆",
        "address":"华润二十四城 [108.38652,22.72439]"
    },
    {
        "name":"海岭",
        "location":"108.334881,22.759934",
        "phone":"电话",
        "city":"良庆",
        "address":"阳光新城蓝波湾  [108.334881,22.759934]"
    },
    {
        "name":"小闭",
        "location":"108.382046,22.861153",
        "phone":"电话",
        "city":"兴宁",
        "address":"盛天东郡 [108.382046,22.861153]"
    },
    {
        "name":"颖红",
        "location":"108.280289,22.774925",
        "phone":"电话",
        "city":"江南",
        "address":"龙光·普罗旺斯 [108.280289,22.774925]"
    },
    {
        "name":"老猫",
        "location":"108.423121,22.818064",
        "phone":"电话",
        "city":"青秀",
        "address":"华凯大院 [108.423121,22.818064]"
    },
    {
        "name":"老鸡",
        "location":"108.362343,22.803984",
        "phone":"电话",
        "city":"青秀",
        "address":"锦春金湖路 [108.362343,22.803984]"
    },
    {
        "name":"小芝麻",
        "location":"108.283297,22.815852",
        "phone":"电话",
        "city":"西乡",
        "address":"龙光·水悦龙湾 [108.283297,22.815852]"
    },
    {
        "name":"瑀红",
        "location":"108.456963,22.783084",
        "phone":"电话",
        "city":"邕宁",
        "address":"yuhong, 江湾山语城 [108.456963,22.783084]"
    },
    {
        "name":"阿罗",
        "location":"108.343757,22.777626",
        "phone":"电话",
        "city":"青秀",
        "address":"柳沙民发大观天下 [108.343757,22.777626]"
    },
    {
        "name":"地高妹",
        "location":"108.351967,22.778378",
        "phone":"电话",
        "city":"青秀",
        "address":"曾瑜，东盟世纪村 [108.351967,22.778378]"
    },
    {
        "name":"仲谋",
        "location":"108.385675,22.843834",
        "phone":"电话",
        "city":"青秀",
        "address":"联发君澜 [108.385675,22.843834]"
    },
    {
        "name":"梁爽",
        "location":"108.419887,22.817313",
        "phone":"电话",
        "city":"青秀",
        "address":"凤岭春天 [108.419887,22.817313]"
    }
];
